** ~micrograd~

The first is simply a port of Andrej Karpathy's [[https://github.com/karpathy/micrograd][micrograd]], which is a
library defining a ref type which builds a directed acyclic graph for
the performed computation of the instance of the type, each time
including a closure storing the derivative. From the generated graph
afterwards we can differentiate in backward mode by traversing the
graph backwards through the closures. This library was not intended to
be efficient by Andrej and neither is this one.

I extended this version to include a wide range of trigonometric and
other functions to make it a bit more useful for optimization problems
(but likely it will be too slow for real world applications).

#+begin_src nim :results raw
import micrograd, strformat

let x = initValue(0.5)
let tn = tanh(x)
tn.backward()
echo "AD: ∂(tanh(x))/∂x|_{x=0.5} = ", &"{x.grad:.4f}"
echo "∂(tanh(x))/∂x|_{x=0.5} = [1 / cosh²(x)]_{x=0.5} = ", &"{1.0 / (cosh(0.5)**2):.4f}"

# and for a use case where the backward mode shines:
proc bar[T](x1, x2: T): T =
  result = tanh(x1) + sinh(x2)

let x1 = initValue(0.5)
let x2 = initValue(1.5)
let res = bar(x1, x2)
res.backward()
echo "AD: ∂f/∂x1|_{x=0.5} = ", &"{x1.grad:.4f}"
echo "AD: ∂f/∂x2|_{x=1.5} = ", &"{x2.grad:.4f}"
#+end_src

#+RESULTS:
AD: ∂(tanh(x))/∂x|_{x=0.5} = 0.7864
∂(tanh(x))/∂x|_{x=0.5} = [1 / cosh²(x)]_{x=0.5} = 0.7864
AD: ∂f/∂x1|_{x=0.5} = 0.7864
AD: ∂f/∂x2|_{x=1.5} = 2.3524

As we can see in the code, after we have computed the result involving
our ~Values~, we call the ~backward~ procedure. This computes the
backward pass for with respect to *all inputs*. As everything is a
~ref object~ the variables ~x1~ and ~x2~ in the second example are
automatically updated to contain the correct gradient ~∂f_∂xi~ afterwards.

